# Testando algumas estruturas de dados com o Pandas

In [3]:
import pandas as pd

In [4]:
data = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [5]:
serie = pd.Series(data)
serie

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [7]:
indice = ['Linha' + str(i) for i in range(10)]
print(indice)

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4', 'Linha5', 'Linha6', 'Linha7', 'Linha8', 'Linha9']

In [8]:
serie = pd.Series(data, index=indice)
serie

Linha0     1
Linha1     2
Linha2     3
Linha3     4
Linha4     5
Linha5     6
Linha6     7
Linha7     8
Linha8     9
Linha9    10
dtype: int64

In [9]:
hashmap = {'Linha' + str(i) : i + 1 for i in range(10)}
hashmap

{'Linha0': 1,
 'Linha1': 2,
 'Linha2': 3,
 'Linha3': 4,
 'Linha4': 5,
 'Linha5': 6,
 'Linha6': 7,
 'Linha7': 8,
 'Linha8': 9,
 'Linha9': 10}

In [11]:
serie = pd.Series(hashmap)
serie

Linha0     1
Linha1     2
Linha2     3
Linha3     4
Linha4     5
Linha5     6
Linha6     7
Linha7     8
Linha8     9
Linha9    10
dtype: int64

In [12]:
serie_1 = serie + 2
serie_2 = serie + 1

In [13]:
serie_1

Linha0     3
Linha1     4
Linha2     5
Linha3     6
Linha4     7
Linha5     8
Linha6     9
Linha7    10
Linha8    11
Linha9    12
dtype: int64

In [14]:
serie_2

Linha0     2
Linha1     3
Linha2     4
Linha3     5
Linha4     6
Linha5     7
Linha6     8
Linha7     9
Linha8    10
Linha9    11
dtype: int64

In [16]:
if len(serie_1) == len(serie_2):
    serie_3 = serie_2 * serie_1
else:
    serie_3 = serie * 0
serie_3

Linha0      6
Linha1     12
Linha2     20
Linha3     30
Linha4     42
Linha5     56
Linha6     72
Linha7     90
Linha8    110
Linha9    132
dtype: int64

In [45]:
data_2 = [[0, 1, 2],
          [3, 4, 5],
          [6, 7, 8]]
data_2

[[0, 1, 2], [3, 4, 5], [6, 7, 8]]

In [18]:
df_1 = pd.DataFrame(data_2)
df_1

   0   1   2
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [48]:
rotulo_linha = ['Linha ' + str(i) for i in range(0, len(data_2), 1)]

In [46]:
label_coluna = ['Coluna ' + str(i) for i in range(len(data_2[0]))]
label_coluna

['Coluna 0', 'Coluna 1', 'Coluna 2']

In [30]:
df_1 = pd.DataFrame(data_2, index=rotulo_linha, columns=label_coluna)
df_1

         Coluna 0  Coluna 1  Coluna 2
Linha 0         0         1         2
Linha 1         3         4         5
Linha 2         6         7         8
Linha 3         9        10        11

In [68]:
data_3 = {'Coluna 0': {'Linha 0': 1, 'Linha 1': 4, 'Linha 2': 7},
                 'Coluna 1': {'Linha 0': 2, 'Linha 1': 5, 'Linha 2': 8},
                 'Coluna 2': {'Linha 0': 3, 'Linha 1': 6, 'Linha 2': 9}}
data_3

{'Coluna 0': {'Linha 0': 1, 'Linha 1': 4, 'Linha 2': 7},
 'Coluna 1': {'Linha 0': 2, 'Linha 1': 5, 'Linha 2': 8},
 'Coluna 2': {'Linha 0': 3, 'Linha 1': 6, 'Linha 2': 9}}

In [69]:
df1 = pd.DataFrame(data_3)
df1

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [70]:
data_4 = [(1, 2, 3),
          (4, 5, 6),
          (7, 8, 9)]
data_4

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [71]:
df2 = pd.DataFrame(data=data_4, index=rotulo_linha, columns=label_coluna)
df2

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [72]:
df3 = pd.DataFrame(data=data_4, index=rotulo_linha, columns=label_coluna)
df3

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [73]:
df1[df1 > 0] = 'A'
df2[df2 > 0] = 'B'
df3[df3 > 0] = 'C'

In [74]:
df1

        Coluna 0 Coluna 1 Coluna 2
Linha 0        A        A        A
Linha 1        A        A        A
Linha 2        A        A        A

In [75]:
df2

        Coluna 0 Coluna 1 Coluna 2
Linha 0        B        B        B
Linha 1        B        B        B
Linha 2        B        B        B

In [76]:
df3

        Coluna 0 Coluna 1 Coluna 2
Linha 0        C        C        C
Linha 1        C        C        C
Linha 2        C        C        C

In [77]:
df4 = pd.concat([df1, df2, df3])
df4

        Coluna 0 Coluna 1 Coluna 2
Linha 0        A        A        A
Linha 1        A        A        A
Linha 2        A        A        A
Linha 0        B        B        B
Linha 1        B        B        B
Linha 2        B        B        B
Linha 0        C        C        C
Linha 1        C        C        C
Linha 2        C        C        C

In [78]:
df4 = pd.concat([df1, df2, df3], axis=1)
df4

,Coluna 0,Coluna 1,Coluna 2,Coluna 0,Coluna 1,Coluna 2,Coluna 0,Coluna 1,Coluna 2
Linha 0,A,A,A,B,B,B,C,C,C
Linha 1,A,A,A,B,B,B,C,C,C
Linha 2,A,A,A,B,B,B,C,C,C

In [79]:
df1 = pd.DataFrame({'A': {'X': 1}, 'B': {'X': 2}})
df2 = pd.DataFrame({'C': {'X': 3}, 'D': {'X': 4}})
pd.concat([df1, df2])

     A    B    C    D
X  1.0  2.0  NaN  NaN
X  NaN  NaN  3.0  4.0

In [80]:
dados = [('A', 'B'), ('C', 'D')]
df = pd.DataFrame(dados, columns = ['L1', 'L2'],  index = ['C1', 'C2'])
df

   L1 L2
C1  A  B
C2  C  D

In [81]:
dados = [[1, 2, 3], [4, 5, 6]]
index = 'X,Y'.split(',')
columns = list('CBA')[::-1]
df = pd.DataFrame(dados, index, columns)
df

   A  B  C
X  1  2  3
Y  4  5  6

In [83]:
index = 'X,Y'.split(',')
index

['X', 'Y']

In [87]:
colunas = 'A, B, C, D, E, F, G, H'.split(', ')
colunas

['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H']